app/views/dockets/_form.html.erb

            <div class="from-control">
              <%= form.select :deliver_to_id, @addresses.all.collect { |a| [a.address, a.id] }, {},
                { class: 'selectpicker', title: "New Address", 'data-live-search': true } %>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]