app/views/dockets/show.html.erb

                <td>
                  <% @user.address.lines.each do |line| %>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]