app/controllers/dockets_controller.rb

  def index
    @dockets = Docket.all
---
SELECT "dockets".* FROM "dockets"

  def create
    @docket = Docket.new(docket_params)

    respond_to do |format|
      if @docket.save
---
INSERT INTO "dockets" ("equipment_no", "customer_reference_no", "seal_no", "description", "return_empty", "deliver_to_id", "collect_from_id", "hazardous_good_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_docket
      @docket = Docket.find(params[:id])
---
SELECT  "dockets".* FROM "dockets" WHERE "dockets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]