app/controllers/hazardous_goods_controller.rb

SELECT "hazardous_goods".* FROM "hazardous_goods"
---
  def index
    @hazardous_goods = HazardousGood.all